fonecmid-diplom/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровУслуг</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ЗадолженностьПоОбслуживанию</registerRecords>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Documents/РеализацияТоваровУслуг/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	
	Если ПравоДоступа("Добавление", Метаданные.Документы.РеализацияТоваровУслуг) Тогда
		
        КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
        КомандаСоздатьНаОсновании.Менеджер = Метаданные.Документы.РеализацияТоваровУслуг.ПолноеИмя();
        КомандаСоздатьНаОсновании.Представление = ОбщегоНазначения.ПредставлениеОбъекта(Метаданные.Документы.РеализацияТоваровУслуг);
        КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";
		
		Возврат КомандаСоздатьНаОсновании;
		
	КонецЕсли;

	Возврат Неопределено;
	
КонецФункции

// Переопределяет настройки печати для объекта.
//
// Параметры:
//  НастройкиОбъекта - см. УправлениеПечатьюПереопределяемый.ПриОпределенииНастроекПечати
//
Процедура ПриОпределенииНастроекПечати(НастройкиОбъекта) Экспорт
	// {{ Новикова А.В.	
	НастройкиОбъекта.ПриДобавленииКомандПечати = Истина;
	// }}
КонецПроцедуры

//   Заполняет список свойств параметра Команды процедуры
///                                  ПодключаемыеКомандыПереопределяемый.ПриОпределенииКомандПодключенныхКОбъекту.
//                                   Ключевые свойства:
//   // Заполняет список команд печати.
//
// Параметры:
//   КомандыПечати - ТаблицаЗначений - см. в УправлениеПечатью.СоздатьКоллекциюКомандПечати                                
//      ** Идентификатор  - Строка - идентификатор команды.
//      ** Представление  - Строка - представление команды в форме.
//      ** Имя            - Строка - имя команды в форме.
//      ** ДополнительныеПараметры - Структура - дополнительные свойства, состав которых определяется видом 
//                                   конкретной команды.
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	// {{ Новикова А.В.
	// Акт
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "АктВыполненныхРабот";
	КомандаПечати.Представление = НСтр("ru = 'Акт выполненных работ'");
	КомандаПечати.Порядок = 5; 
	// }}
КонецПроцедуры 

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов        - см. УправлениеПечатью.СведенияОПечатнойФорме.МассивОбъектов
//  ПараметрыПечати       - см. УправлениеПечатью.СведенияОПечатнойФорме.ПараметрыПечати
//  КоллекцияПечатныхФорм - см. УправлениеПечатью.СведенияОПечатнойФорме.КоллекцияПечатныхФорм
//  ОбъектыПечати         - см. УправлениеПечатью.СведенияОПечатнойФорме.ОбъектыПечати
//  ПараметрыВывода       - см. УправлениеПечатью.СведенияОПечатнойФорме.ПараметрыВывода
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	// {{ Новикова А.В.
	ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "АктВыполненныхРабот");
	Если ПечатнаяФорма <> Неопределено Тогда
		ПечатнаяФорма.ТабличныйДокумент = ПечатьАктаВыполненныхРабот(МассивОбъектов, ОбъектыПечати);
		ПечатнаяФорма.СинонимМакета = НСтр("ru = 'Акт Выполненных Работ'");
		ПечатнаяФорма.ПолныйПутьКМакету = "Документ.РеализацияТоваровУслуг.ПФ_MXL_АктВыполненныхРабот";
	КонецЕсли; 
	// }}
КонецПроцедуры 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

 Функция ПечатьАктаВыполненныхРабот(МассивОбъектов, ОбъектыПечати)
	// {{ Новикова А.В.
	 //формируем табличный документ
	 ТабличныйДокумент = Новый ТабличныйДокумент;
	 ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_АктВыполненныхРабот";
	 
	 Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.РеализацияТоваровУслуг.ПФ_MXL_АктВыполненныхРабот"); 
	 
	 //собрать данные 
	 ДанныеДокументов = ПолучитьДанныеДокументов(МассивОбъектов);
	 //печать страниц
	 ПервыйДокумент = Истина;
	 
	 Пока ДанныеДокументов.Следующий() Цикл
		 
		 Если Не ПервыйДокумент Тогда
			 // Все документы нужно выводить на разных страницах.
			 ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		 КонецЕсли;
		 
		 ПервыйДокумент = Ложь;
		 
		 НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1; 
		 //шапка	
		 ВывестиЗаголовокАктаВыполненныхРабот(ДанныеДокументов, ТабличныйДокумент, Макет);
		 //таб.часть	
		 ВывестиУслуги(ДанныеДокументов, ТабличныйДокумент, Макет);
		 
		 ВывестиПодвалАктаВыполненныхРабот(ДанныеДокументов, ТабличныйДокумент, Макет);
		 // В табличном документе необходимо задать имя области, в которую был 
		 // выведен объект. Нужно для возможности печати комплектов документов.
		 УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
		 НомерСтрокиНачало, ОбъектыПечати, ДанныеДокументов.Ссылка);	
	 КонецЦикла;	
	 Возврат ТабличныйДокумент;	
	 // }}
КонецФункции

Функция ПолучитьДанныеДокументов(МассивОбъектов)
	// {{ Новикова А.В.
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка КАК Ссылка,
	|	РеализацияТоваровУслуг.Номер КАК Номер,
	|	РеализацияТоваровУслуг.Дата КАК Дата,
	|	РеализацияТоваровУслуг.Организация КАК Организация,
	|	РеализацияТоваровУслуг.Контрагент КАК Контрагент,
	|	РеализацияТоваровУслуг.Договор КАК Договор,
	|	РеализацияТоваровУслуг.Услуги.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		Номенклатура КАК Номенклатура,
	|		Количество КАК Количество,
	|		Цена КАК Цена,
	|		Сумма КАК Сумма) КАК Услуги,
	|	РеализацияТоваровУслуг.СуммаДокумента КАК СуммаДокумента
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Ссылка В(&МассивОбъектов)";
	
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	Возврат Запрос.Выполнить().Выбрать();
	// }}
КонецФункции

Процедура ВывестиУслуги(ДанныеДокументов, ТабличныйДокумент, Макет)
	// {{ Новикова А.В.
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("УслугиШапка");
	ОбластьСтрока = Макет.ПолучитьОбласть("УслугиСтрока");
	
	ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);
	
	ВыборкаУслуги = ДанныеДокументов.Услуги.Выбрать();
	Пока ВыборкаУслуги.Следующий() Цикл
		ОбластьСтрока.Параметры.Заполнить(ВыборкаУслуги);
		ТабличныйДокумент.Вывести(ОбластьСтрока);
	КонецЦикла;
	// }}
КонецПроцедуры

Процедура ВывестиЗаголовокАктаВыполненныхРабот(ДанныеДокументов, ТабличныйДокумент, Макет)
	// {{ Новикова А.В.
	ОбластьЗаголовокДокумента = Макет.ПолучитьОбласть("Заголовок");
	
	ДанныеПечати = Новый Структура;
	
	ШаблонЗаголовка = "Акт № %1 о приемке выполненных работ (оказанных услуг) от %2";
	ТекстЗаголовка = СтрШаблон(ШаблонЗаголовка,
	ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ДанныеДокументов.Номер),
	Формат(ДанныеДокументов.Дата, "ДЛФ=DD"));
	ДанныеПечати.Вставить("ТекстЗаголовка", ТекстЗаголовка);
	ДанныеПечати.Вставить("Организация", ДанныеДокументов.Организация); 
	ДанныеПечати.Вставить("Контрагент", ДанныеДокументов.Контрагент);
	ДанныеПечати.Вставить("Договор", ДанныеДокументов.Договор);
	ОбластьЗаголовокДокумента.Параметры.Заполнить(ДанныеПечати);
	
	ТабличныйДокумент.Вывести(ОбластьЗаголовокДокумента);
	// }}
КонецПроцедуры  

Процедура ВывестиПодвалАктаВыполненныхРабот(ДанныеДокументов, ТабличныйДокумент, Макет)
	// {{ Новикова А.В.
	ОбластьПодвалАктаВыполненныхРабот = Макет.ПолучитьОбласть("Подвал");
    ДанныеПечати = Новый Структура;
	
	
	ДанныеПечати.Вставить("ИтогоСумма", ДанныеДокументов.СуммаДокумента);
	ИтогоПрописью = ЧислоПрописью(ДанныеДокументов.СуммаДокумента, , "рубль, рубля, рублей, м, копейка, копейки, копеек, ж");
	ДанныеПечати.Вставить("СуммаПрописью", ИтогоПрописью);
	ОбластьПодвалАктаВыполненныхРабот.Параметры.Заполнить(ДанныеПечати);
	
	ТабличныйДокумент.Вывести(ОбластьПодвалАктаВыполненныхРабот);
	// }}
КонецПроцедуры 


#КонецОбласти
#КонецЕсли
